{
    "$schema": "https://schema.management.azure.com/schemas/2018-05-01/subscriptionDeploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "location": {
            "type": "string"
        },
        "workspace": {
            "type": "string",
            "metadata": {
                "description": "Log Analytics Workspace name with Microsoft Sentinel enabled."
            }
        }
    },
    "variables": {},
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/493b6376-8cd5-4bbe-ac58-54b4f64aafbe')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/493b6376-8cd5-4bbe-ac58-54b4f64aafbe')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "thealistairross - Test Entities Rule Destination",
                "description": "This rule looks for alerts called \"thealistairross - Test Entities Rule Source\" and maps the entities from that rule using Sentinel Entities mapping.\n\nFor more details on this demo, visit https://thealistairross0.wordpress.com/2023/07/20/microsoft-sentinel-entities-3-of-4-cross-workspace",
                "severity": "Informational",
                "enabled": true,
                "query": "SecurityAlert\n| where AlertName == \"thealistairross - Test Entities Rule Source\"\n| summarize arg_max(TimeGenerated, *) by SystemAlertId\n\n",
                "queryFrequency": "P14D",
                "queryPeriod": "P14D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "P1D",
                "suppressionEnabled": false,
                "startTimeUtc": "2023-07-15T11:00:00.000Z",
                "tactics": [],
                "techniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AnyAlert",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "AlertPerResult"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": null,
                "sentinelEntitiesMappings": [
                    {
                        "columnName": "Entities"
                    }
                ],
                "templateVersion": null
            }
        },
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ed286f76-a8f9-453f-991e-9e343fb86458')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ed286f76-a8f9-453f-991e-9e343fb86458')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "thealistairross - Test Entities Rule Source",
                "description": "This is the Analytic rule which will generate a simulated alert with two entities.\nFor more details on this demo visit https://thealistairross0.wordpress.com/2023/07/17/microsoft-sentinel-entities-2-of-4-mapping",
                "severity": "Informational",
                "enabled": true,
                "query": "print FullName = \"thealistairross@contoso.com\", IPAddress = \"10.0.0.4\"",
                "queryFrequency": "P14D",
                "queryPeriod": "P14D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "P1D",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [],
                "techniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "FullName"
                            }
                        ]
                    },
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "IPAddress"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }


    ],
    "outputs": {}
}