Parser:
  Title: Azure Privileged Identity Manager Mapped Events
  Version: "0.1"
  LastUpdated: Feb 10 2023
Product:
  Name: Azure Priviliged Identity Manager
Description: This parsers out the Azure Privileged Identity Manager logs from the Active Directory AuditLog table.
ParserName: AzurePIMEvents
ParserParams:
  Name: disabled
  Type: bool
  Default: "false"
ParserQuery: |-
  // This Parser is a work in progress by Alistair Ross (aliross@microsoft.com)
  // Feel free to contribute at https://github.com/TheAlistairRoss/MicrosoftSentinel/tree/main/Solutions/AzurePrivilegedIdentityManager
  // Requires AzurePIMOperationsMappings Parser
  AuditLogs
  | where Category in ("RoleManagement", "ResourceManagement")
  | join kind=inner  (
      AzurePIMOperationsMappings
      )
      on OperationName
  // Extract the object details
  | extend ObjectId = case(
      Category == "ResourceManagement", trim(@'^\"|\"$', tostring(TargetResources[toint(ObjectIndexSet[0])].modifiedProperties.[toint(ObjectIndexSet[1])].[tostring(ObjectIndexSet[2])])),
      tostring(TargetResources[toint(ObjectIndexSet[0])].id)
      )
  | extend Object = case(
      array_length(ObjectIndexSet) == 0, "", 
      array_length(ObjectIndexSet) > 0, case(
      isnotempty(tostring(TargetResources[toint(ObjectIndexSet[0])].userPrincipalName)), tostring(TargetResources[toint(ObjectIndexSet[0])].userPrincipalName),
      tostring(TargetResources[toint(ObjectIndexSet[0])].displayName)
      ),
      "Unknown Mapping"
      )
  | extend Object = case((Object startswith replace_string(ObjectId, "-", "")), substring(Object, strlen(replace_string(ObjectId, "-", ""))), Object)
  | extend ObjectType = tostring(TargetResources[toint(ObjectIndexSet[0])].type)
  | extend Role = case(
      array_length(RoleNameIndexSet) == 0, "",
      array_length(RoleNameIndexSet) == 1, trim(@'^\"|\"$', tostring(TargetResources[toint(RoleNameIndexSet[0])].displayName)),
      array_length(RoleNameIndexSet) == 3, trim(@'^\"|\"$', tostring(TargetResources[toint(RoleNameIndexSet[0])].modifiedProperties.[toint(RoleNameIndexSet[1])].[tostring(RoleNameIndexSet[2])])),
      "Unknown Mapping"
      )
  | extend RoleId = case(
      array_length(RoleIdIndexSet) == 0, "",
      array_length(RoleIdIndexSet) == 1, trim(@'^\"|\"$', tostring(TargetResources[toint(RoleIdIndexSet[0])].id)),
      array_length(RoleIdIndexSet) == 3, trim(@'^\"|\"$', tostring(TargetResources[toint(RoleIdIndexSet[0])].modifiedProperties.[toint(RoleIdIndexSet[1])].[tostring(RoleIdIndexSet[2])])),
      "Unknown Mapping"
      )
  | extend InitiatedByType = tostring(bag_keys(parse_json(InitiatedBy))[0])
  | extend InitiatedByObject = case(
      (InitiatedByType == "user"), case(
      isnotempty(tostring(parse_json(InitiatedBy.user.userPrincipalName))), tostring(parse_json(InitiatedBy.user.userPrincipalName)), 
      tostring(parse_json(InitiatedBy.user.displayName))
      ),
      (InitiatedByType == "app"), tostring(parse_json(InitiatedBy.app.displayName)),
      "Unknown Mapping"
      )
  | extend InitiatedByObjectId = case(
      (InitiatedByType == "user"), tostring(parse_json(InitiatedBy.user.id)),
      (InitiatedByType == "app"), tostring(parse_json(InitiatedBy.app.servicePrincipalId)),
      "Unknown Mapping"
      )
  | project-away OperationName1, RoleIdIndexSet, RoleNameIndexSet, ObjectIndexSet
  | project-reorder
      TimeGenerated,
      Role,
      RoleId,
      Object,
      ObjectId,
      ObjectType,
      InitiatedByObject,
      InitiatedByObjectId,
      InitiatedByType,
      Result,
      ResultDescription,
      OperationDescription