{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "variables": {},
    "resources": [
        {
            "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
            "apiVersion": "2020-08-01",
            "name": "[concat(parameters('workspace'), '/6bbec945-aca1-4bd1-bb53-68e03272acc8_azurepimoperationsmappings')]",
            "dependsOn": [
                "[resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace'))]"
            ],
            "properties": {
                "category": "PIM",
                "displayName": "AzurePIMOperationsMappings",
                "query": "datatable (\r\n    OperationName: string,\r\n    RoleIdMapping: dynamic,\r\n    ObjectMapping: dynamic,\r\n    RoleNameMapping: dynamic\r\n) [\r\n    \"Add eligible member to role\", dynamic([0, 0, \"newValue\"]), dynamic([0]), dynamic([0, 1, \"newValue\"]),\r\n    \"Add eligible member to role in PIM completed (permanent)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Add eligible member to role in PIM completed (timebound)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Add eligible member to role in PIM requested (permanent)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Add eligible member to role in PIM requested (renew)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Add eligible member to role in PIM requested (timebound)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Add EligibleRoleAssignement to RoleDefinition\", dynamic([]), dynamic([]), dynamic([]),\r\n    \"Add member to role\", dynamic([0, 0, \"newValue\"]), dynamic([0]), dynamic([0, 1, \"newValue\"]),\r\n    \"Add member to role canceled (PIM activation)\", dynamic([]), dynamic([]), dynamic([]),\r\n    \"Add member to role completed (PIM activation)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Add member to role in PIM completed (permanent)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Add member to role in PIM completed (timebound)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Add member to role in PIM requested (permanent)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Add member to role in PIM requested (renew)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Add member to role in PIM requested (timebound)\", dynamic([0]), dynamic([0]), dynamic([0]),\r\n    \"Add member to role outside of PIM (permanent)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Add member to role request approved (PIM activation)\", dynamic([0]), dynamic([2]), dynamic([2]),\r\n    \"Add member to role request denied (PIM activation)\", dynamic([]), dynamic([]), dynamic([]),\r\n    \"Add member to role requested (PIM activation)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Add role assignment to role definition\", dynamic([0, 4, \"newValue\"]), dynamic([]), dynamic([0, 5, \"newValue\"]),\r\n    \"Add role definition\", dynamic([0]), dynamic([]), dynamic([0]),\r\n    \"Add scoped member to role\", dynamic([0, 0, \"newValue\"]), dynamic([0]), dynamic([0, 1, \"newValue\"]),\r\n    \"Offboarded resource from PIM\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Onboarded resource to PIM\", dynamic([]), dynamic([]), dynamic([]),\r\n    \"PIM activation request expired\", dynamic([]), dynamic([]), dynamic([]),\r\n    \"Process request\", dynamic([]), dynamic([]), dynamic([]),\r\n    \"Process role update request\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Remove eligible member from role\", dynamic([0, 0, \"oldValue\"]), dynamic([0]), dynamic([0, 1, \"oldValue\"]),\r\n    \"Remove eligible member from role in PIM completed (permanent)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Remove eligible member from role in PIM completed (timebound)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Remove eligible member from role in PIM requested (permanent)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Remove eligible member from role in PIM requested (timebound)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Remove EligibleRoleAssignement from RoleDefinition\", dynamic([0, 3, \"oldValue\"]), dynamic([]), dynamic([0, 4, \"oldValue\"]),\r\n    \"Remove member from role\", dynamic([0, 0, \"oldValue\"]), dynamic([0]), dynamic([0, 1, \"oldValue\"]),\r\n    \"Remove member from role (PIM activation expired)\", dynamic([0]), dynamic([3]), dynamic([0]),\r\n    \"Remove member from role completed (PIM deactivate)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Remove member from role in PIM completed (permanent)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Remove member from role in PIM completed (timebound)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Remove member from role in PIM requested (permanent)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Remove member from role in PIM requested (timebound)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Remove member from role requested (PIM deactivate)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Remove permanent direct role assignment\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Remove permanent eligible role assignment\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Remove role assignment from role definition\", dynamic([0, 4, \"oldValue\"]), dynamic([0]), dynamic([0, 5, \"oldValue\"]),\r\n    \"Update eligible member in PIM canceled (extend)\", dynamic([]), dynamic([]), dynamic([]),\r\n    \"Update eligible member in PIM requested (extend)\", dynamic([0]), dynamic([2]), dynamic([0]),\r\n    \"Update role\", dynamic([0]), dynamic([]), dynamic([0]),\r\n    \"Update role setting in PIM\", dynamic([0]), dynamic([]), dynamic([0])\r\n]\r\n",
                "functionAlias": "AzurePIMOperationsMappings",
                "version": 2
            }
        },
        {
            "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
            "apiVersion": "2020-08-01",
            "name": "[concat(parameters('workspace'), '/bdee4167-f27f-4555-82f6-e006359db767_azurepimevents')]",
            "dependsOn": [
                "[resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspace'))]"
            ],
            "properties": {
                "category": "PIM",
                "displayName": "AzurePIMEvents",
                "query": "AuditLogs\r\n| where Category in (\"RoleManagement\", \"ResourceManagement\")\r\n| join kind = leftouter AzurePIMOperationsMappings() on OperationName\r\n| extend ObjectId = tostring(TargetResources[toint(ObjectMapping[0])].id)\r\n| extend Object = case(\r\n    (array_length(ObjectMapping) <= 0), \"\", \r\n    array_length(ObjectMapping) == 1, case(\r\n        isnotempty(tostring(TargetResources[toint(ObjectMapping[0])].userPrincipalName)), tostring(TargetResources[toint(ObjectMapping[0])].userPrincipalName),\r\n        tostring(TargetResources[toint(ObjectMapping[0])].displayName)\r\n    ),\r\n    \"Unknown Mapping\"\r\n)\r\n| extend Object = case((Object startswith replace_string(ObjectId,\"-\",\"\")), substring(Object, strlen(replace_string(ObjectId,\"-\",\"\"))), Object)\r\n| extend ObjectType = tostring(TargetResources[toint(ObjectMapping[0])].type)\r\n| extend Role = case(\r\n    array_length(RoleNameMapping) == 1, trim(@'^\\\"|\\\"$', tostring(TargetResources[toint(RoleNameMapping[0])].displayName)),\r\n    array_length(RoleNameMapping) == 3, trim(@'^\\\"|\\\"$', tostring(TargetResources[toint(RoleNameMapping[0])].modifiedProperties.[toint(RoleNameMapping[1])].[tostring(RoleNameMapping[2])])),\r\n    \"Unknown Mapping\"\r\n    )\r\n| extend RoleId = case(\r\n    array_length(RoleIdMapping) == 1, trim(@'^\\\"|\\\"$', tostring(TargetResources[toint(RoleIdMapping[0])].id)),\r\n    array_length(RoleIdMapping) == 3, trim(@'^\\\"|\\\"$', tostring(TargetResources[toint(RoleIdMapping[0])].modifiedProperties.[toint(RoleIdMapping[1])].[tostring(RoleIdMapping[2])])),\r\n    \"Unknown Mapping\"\r\n)\r\n| extend RoleType = case(\r\n    Category == \"RoleManagement\", \"Azure AD Role\",\r\n    Category == \"Resourcemanagement\", \"Azure RBAC Role\",\r\n    \"Unknown Mapping\"\r\n)\r\n| extend InitiatedByType = tostring(bag_keys(parse_json(InitiatedBy))[0])\r\n| extend InitiatedByObject = case(\r\n    (InitiatedByType == \"user\"), case(\r\n        isnotempty(tostring(parse_json(InitiatedBy.user.userPrincipalName))), tostring(parse_json(InitiatedBy.user.userPrincipalName)), \r\n        tostring(parse_json(InitiatedBy.user.displayName))\r\n    ),\r\n    (InitiatedByType == \"app\"), tostring(parse_json(InitiatedBy.app.displayName)),\r\n    \"Unknown Mapping\"\r\n)\r\n| extend InitiatedByObjectId = case(\r\n    (InitiatedByType == \"user\"), tostring(parse_json(InitiatedBy.user.id)),\r\n    (InitiatedByType == \"app\"), tostring(parse_json(InitiatedBy.app.servicePrincipalId)),\r\n    \"Unknown Mapping\"\r\n)\r\n| project-away OperationName1, ObjectMapping, RoleIdMapping, RoleNameMapping\r\n",
                "functionAlias": "AzurePIMEvents",
                "version": 2
            }
        }
    ]
}